# IFCImport Options Link Orientation Property

Source: https://www.revitapidocs.com/2026/6eeeeb82-c769-ac1e-ea46-e4cb320df9f1.htm

---

| IFCImport Options Link Orientation Property |
| --- |

The orientation of the Linked IFC File in the Host Document.
**Namespace:** Autodesk.Revit.DB.IFC
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public IFCLinkOrientation LinkOrientation { get; set; }
```

```
Public Property LinkOrientation As IFCLinkOrientation
	Get
	Set
```

```
public:
property IFCLinkOrientation LinkOrientation {
	IFCLinkOrientation get ();
	void set (IFCLinkOrientation value);
}
```

```
member LinkOrientation : IFCLinkOrientation with get, set
```

#### Property Value

IFCLinkOrientation Exceptions

| Exception | Condition |
| --- | --- |
| ArgumentOutOfRangeException | When setting this property: A value passed for an enumeration argument is not a member of that enumeration |

See Also

#### Reference

IFCImportOptions Class Autodesk.Revit.DB.IFC Namespace